Revit 2027 API
BuiltInFailures.RebarFailures.InvalidRebarHostNonConcrete Property
 Rebar can't be placed in a structural family unless its [Material Type] is [Concrete].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidRebarHostNonConcrete { get; }
Public Shared ReadOnly Property InvalidRebarHostNonConcrete As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidRebarHostNonConcrete {
	FailureDefinitionId^ get ();
}
static member InvalidRebarHostNonConcrete : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace